using System.Windows;
//-----------------------------------------------------------------------КОНВЕНЦИЯ СТИЛЯ--------------------------------------------------------------------------------------
//---------------------------------------------------------------ВСЕ ПЕРЕМЕННЫЕ - С МАЛЕНЬКОЙ БУКВЫ!--------------------------------------------------------------------------
//-------------------------------------------------------------------МЕТОДЫ И КЛАССЫ - С БОЛЬШОЙ!-----------------------------------------------------------------------------
namespace Cluster_Analisys
{
    /// <summary>
    /// Логика взаимодействия для главной формы MainWindow.xaml
    /// </summary>
    partial class MainWindow : Window
    {
        private int file_counter = 0; // Счетчик - отслеживает кол - во загруженных в программу файлов. При загрузке программы = 0

        /// <summary>
        /// Конструктор для главной формы
        /// </summary>
        public MainWindow()
        {
            InitializeComponent();
        }

        private void Main_Window_Closing(object sender, System.ComponentModel.CancelEventArgs e)
        {
            Exit_App(sender, e);
        }
    }
}
